# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'node'
brew 'wget'
brew 'mas'

# Development
brew 'php'
brew 'php-intl'
brew 'php-imagick'
brew 'composer'
brew 'mysql'

# Apps
cask 'docker'
cask 'google-chrome'
cask 'postman'
cask 'visual-studio-code'
cask 'tableplus'
cask 'warp'
cask 'firefox'
cask 'microsoft-edge'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Microsoft Remote Desktop', id: 1295203466

